package main

import (
	"fmt"
	//"strconv"
)

// 2164
func main() {
	//fmt.Println("Hello, World!")
	var n int
	fmt.Scanf("%d", &n)
  //123 23 32 2
  //1-> 1
  //2 -> 2 
  // 3 -> 2 
  // 4-> 1234 -> 234 -> 342 -> 42 -> 24 -> 4 
  // 5 -> 2345 -> 3452 -> 452 -> 524 -> 24 -> 42   2
  // 6-> 23456 1버림 -> 34562 2내림 -> 4562 3버림 -> 5624 4내림 -> 624 5버림 -> 246 6내림 -> 46 2버림 -> 64 4내림 -> 6버림 4
  // 7 -> 234567 1버림 -> 345672 2내림  -> 45672 3버림 -> 56724 4내림 -> 6724 5버림 -> 7246 6내림 -> 246 7버림 -> 2내림 462 -> 62 4버림 -> 26 6내림 -> 2버림 -> 6 
  // 8 -> 2345678 1버림 -> 3456782 2내림 -> 456782 3버림 -> 567824 4내림 -> 67824 5버림 -> 78246 6내림 -> 8246 7버림 -> 2468 8내림 -> 468 2버림 -> 684 4내림 -> 84 6버림 -> 8내림 48 -> 4버림 8 
  // n~50,0000
  arr := make([]int,0)
  for i:=1; i<=n; i++ {
    arr = append(arr,i)
  }
  
  for i:=1 ; len(arr)>1 ; i++{
    tmp := -1
    if i%2 == 0 { //내림 
      tmp = arr[0]
      arr = append(arr,tmp)
      arr = arr[1:]
      
    }else { //버림 
      arr = arr[1:]
    }
    //tmp := arr[len(arr)-1:]
    //fmt.Printf("%d // %+v\n",tmp,arr)
  }
  fmt.Printf("%d",arr[0])

}